### WORKSHOP 
- Pandas dataframe 연습

In [14]:
import pandas as pd
import numpy as np

In [15]:
# DataFrame
data = {'state':['oh','oh','oh','Nev','Nev'],
       'year':[2000,2001,2002,2001,2002],
       'population':[1.5, 1.7, 2.3, 2.9, 3.2]}
data

{'state': ['oh', 'oh', 'oh', 'Nev', 'Nev'],
 'year': [2000, 2001, 2002, 2001, 2002],
 'population': [1.5, 1.7, 2.3, 2.9, 3.2]}

In [16]:
df = pd.DataFrame(data) 
df

  state  year  population
0    oh  2000         1.5
1    oh  2001         1.7
2    oh  2002         2.3
3   Nev  2001         2.9
4   Nev  2002         3.2

In [17]:
# 'one','two','three','four','five' 순서대로 인덱스를 만들고, 
# 컬럼도  'year','state','population','debt' 를 이용하여 
# 데이터 프레임을  다시 만들어보세요. 
# df =   # code here 


df = pd.DataFrame(data, columns=['year','state','population','debt']
                   , index=['one','two','three','four','five'])

In [18]:
df

       year state  population debt
one    2000    oh         1.5  NaN
two    2001    oh         1.7  NaN
three  2002    oh         2.3  NaN
four   2001   Nev         2.9  NaN
five   2002   Nev         3.2  NaN

In [19]:
#df의 컬럼값만 출력해보세요. 
df.columns

Index(['year', 'state', 'population', 'debt'], dtype='object')

In [20]:
# df 의 state 컬럼만 출력해보세요. 

df['state']

one       oh
two       oh
three     oh
four     Nev
five     Nev
Name: state, dtype: object

In [21]:
# index 'three'에 해당하는 행만 출력해보세요. 

df.loc['three']

year          2002
state           oh
population     2.3
debt           NaN
Name: three, dtype: object

In [22]:
df['debt']=15   
df

       year state  population  debt
one    2000    oh         1.5    15
two    2001    oh         1.7    15
three  2002    oh         2.3    15
four   2001   Nev         2.9    15
five   2002   Nev         3.2    15

In [23]:
# numpy의 arange 함수를 이용하여 0 부터 4까지 연속된 데이터를 출력하세요. 
np.arange(5)

array([0, 1, 2, 3, 4])

In [24]:
df['debt'] = np.arange(5)
df

       year state  population  debt
one    2000    oh         1.5     0
two    2001    oh         1.7     1
three  2002    oh         2.3     2
four   2001   Nev         2.9     3
five   2002   Nev         3.2     4

In [25]:
#df에 'estern' 컬럼을 추가하고,  df의 state가 'oh' 인지 아닌지 boolean 정보를 컬럼값으로 추가해보세요. 

df['estern'] = df.state=='oh'
df

       year state  population  debt  estern
one    2000    oh         1.5     0    True
two    2001    oh         1.7     1    True
three  2002    oh         2.3     2    True
four   2001   Nev         2.9     3   False
five   2002   Nev         3.2     4   False

In [28]:
# three 행의  population 열의 값을 출력하세요. 

df.loc['three', 'population']

2.3

In [29]:
# year가 2002년도의 population을 구하세요. 행부분에 조건문을 이용하세요. 

df.loc[df.year == 2002, 'population']

three    2.3
five     3.2
Name: population, dtype: float64

In [30]:
# population 가  2.5 이상인 행을 추출하세요. 

df.loc[df.population >= 2.5]

      year state  population  debt
four  2001   Nev         2.9     3
five  2002   Nev         3.2     4

In [33]:
# 가장 인구수가 많은 행을 출력하세요. 
# (내림차순으로 정렬하여 top1를 출력)
df.sort_values('population', ascending=False).head(1)

      year state  population  debt
five  2002   Nev         3.2     4